import Footer from "@/components/layout/footer";
import FirstSection from "@/features/hotel/components/first-section";
import Title from "@/components/ui/Title";

const PrivacyPolicy = () => {
  return (
    <div className="min-h-screen bg-white overflow-x-hidden max-w-[2048px] mx-auto">
      <FirstSection title="Политика конфиденциальности" />
      <section className="px-5 md:mb-16 mt-5 lg:mb-[60px]">
        <div className="flex flex-col gap-8 md:gap-10 max-w-[1280px] mx-auto">
          <div className="flex flex-col gap-4 md:gap-5 max-w-[900px]">
            <p className="p1">Политика обработки персональных данных (далее – Политика или Политика конфиденциальности) разработана ИП Демин В.А. в соответствии с Федеральным законом от 27.07.2006. №152-ФЗ «О персональных данных» (далее – ФЗ-152).<br /><br />Настоящая Политика определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных у владельца сайта <b>hotelpremium.ru (далее hotelpremium.ru или Оператор)</b>.<br /><br />Целью настоящей политики конфиденциальности является обеспечение защиты прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.<br /><br /><b>Если Вы не согласны с условиями нашей Политики конфиденциальности, не используйте сайт hotelpremium.ru!</b><b></b></p>
            <p className="p1"><b>1. Настоящая Политика содержит следующую информацию:</b><br />— цель обработки персональных данных; <br />— перечень персональных данных, на обработку которых дается согласие субъекта персональных данных; <br />— наименование или фамилия, имя, отчество и адрес лица, осуществляющего обработку персональных данных по поручению оператора, если обработка будет поручена такому лицу; <br />— перечень действий с персональными данными, на совершение которых дается согласие, общее описание используемых оператором способов обработки персональных данных; <br />— срок, в течение которого действует согласие субъекта персональных данных, а также способ его отзыва, если иное не установлено федеральным законом;<br />— информацию о том, как можно отозвать свое согласие на обработку персональных данных.</p>
            <p className="p1"><b>2. Основные понятия, используемые в настоящей политике конфиденциальности:</b><br /><b>Персональные данные</b> — любая информация, относящаяся прямо или косвенно к определенному или определяемому физическому лицу (субъекту персональных данных); <br /><b>Оператор</b> — государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными; <br /><b>Обработка персональных данных</b> — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;</p>
            <p className="p1"><b>3. Принципы сбора персональных данных:</b><br />— Обработка персональных данных осуществляется на законной и справедливой основе <br />— Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных целей. <br />— Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой. <br />— Обработке подлежат только персональные данные, которые отвечают целям их обработки. <br />— Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям обработки. <br />— При обработке персональных данных обеспечиваются точность персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных. <br />— Оператор принимает необходимые меры либо обеспечивает их принятие по удалению или уточнению неполных или неточных данных. <br />— Хранение персональных данных осуществляется в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен федеральным законом, договором, стороной которого, выгодоприобретателем или поручителем по которому является субъект персональных данных. Обрабатываемые персональные данные подлежат уничтожению либо обезличиванию по достижении целей обработки или в случае утраты необходимости в достижении этих целей, если иное не предусмотрено федеральным законом.</p>
            <p className="p1"><b>4. Перечень собираемых персональных данных</b><b></b></p>
            <p className="p2">Оператор сайта может собирать следующую информацию о пользователях сайта:</p>
            <p className="p2">— Фамилия, Имя, Отчество</p>
            <p className="p2">— Возраст</p>
            <p className="p2">— Адрес электронной почты</p>
            <p className="p2">— Номер телефона</p>
            <p className="p2">— cookies</p>
            <p className="p2">— <span className="s1">С</span>ведения, собираемые посредством метрических программ</p>
            <p className="p2">При заселении оператор вправе делать копии с удостоверением личности гражданина, которые содержат следующие сведения:</p>
            <p className="p2">— фамилия, имя, отчество</p>
            <p className="p2">— год рождения</p>
            <p className="p2">— месяц рождения</p>
            <p className="p2">— дата рождения</p>
            <p className="p2">— место рождения</p>
            <p className="p2">— пол</p>
            <p className="p2">— семейное положение</p>
            <p className="p2">— адрес электронной почты</p>
            <p className="p2">— адрес регистрации</p>
            <p className="p2">— гражданство</p>
            <p className="p1">— данные документа, удостоверяющего личность</p>
            <p className="p1"><b>5. Управление персональными данными пользователя</b><b></b></p>
            <p className="p1">Отзыв согласия на обработку Персональных данных пользователя, а также удаление Персональных данных пользователя возможно по его письменному запросу, присланному на e-mail Оператора <b>hotelpremium2016@yandex.ru</b>, однако в случае отзыва согласия или удаления персональных данных, Оператор не может гарантировать качественного и всестороннего предоставления информации и/или услуг.</p>
            <p className="p1"><b>6. Использование информации</b><b></b></p>
            <p className="p2">Ниже описаны способы использования личной информации пользователя:</p>
            <p className="p2">— сбор</p>
            <p className="p2">— систематизация</p>
            <p className="p2">— хранение</p>
            <p className="p2">— использование</p>
            <p className="p2">— удаление</p>
            <p className="p2">— уничтожение</p>
            <p className="p2"><b>Цели:</b><b></b></p>
            <ul className="ul1">
              <li className="li2">предоставление мне услуг/работ;</li>
              <li className="li2">направление в мой адрес уведомлений, касающихся предоставляемых услуг/работ;</li>
              <li className="li2">подготовка и направление ответов на мои запросы;</li>
              <li className="li1">направление в мой адрес информации, в том числе рекламной, о мероприятиях/товарах/услугах/работах Оператора.</li>
            </ul>
            <p className="p1"><b>7. Раскрытие информации</b><b></b></p>
            <p className="p1">Оператор не продает личные данные пользователя и не передает их третьим лицам без согласия на то пользователя.<br />Далее, описаны некоторые случаи передачи личной информации пользователя:<br />— в случаях, если это требуется органам спецслужб или если это требует законодательство</p>
            <p className="p1"><b>8. Меры по обеспечению безопасности персональных данных при их обработке&nbsp;</b></p>
            <p className="p1">Для предотвращения несанкционированного доступа, неоговоренной передачи персональных данных третьим лицам, нецелевого использования полученной информации, а также иных неправомерных действий, ООО «Интурист-Новгород» использует правовые, организационные (корпоративные), технические и иные не запрещенные законодательством Российской Федерации меры защиты.</p>
            <p className="p1"><b>9. Прочая информация</b><br />— Срок действия настоящей Политики конфиденциальности не ограничен<br />— Настоящая Политика конфиденциальности теряет свою силу при появлении новой версии, размещенной на сайте <b>hotelpremium.ru</b><br />— Дети любых возрастов могут беспрепятственно пользоваться данным сайтом</p>
            <p className="p1"><b>10. Контактные данные</b><b></b></p>
            <p className="p1">Если у вас есть вопросы о настоящей Политике конфиденциальности, деятельности сайта или о чём-либо другом, Вы можете связаться с нами:</p>
            <p className="p1">ИП Демин Вячеслав Алексеевич</p>
            <p className="p1">hotelpremium.ru</p>
            <p className="p1">МО, г. Щелково, улица Талсинская, дом 9/2</p>
            <p className="p1">hotelpremium2016@yandex.ru</p>
          </div>
        </div>
      </section>
      <Footer />
    </div>
  );
};

export default PrivacyPolicy;
